[NoCoverage] StringLiteral
ReactCourses/minesweeper-react/src/index.tsx:14:44
     </Top>
     <Scoreboard
       time='000'
-      levels={['beginner', 'intermediate', 'expert']}
+      levels={['beginner', 'intermediate', ""]}
       bombs='010'
       onReset={() => null}

[NoCoverage] StringLiteral
ReactCourses/minesweeper-react/src/index.tsx:14:16
     </Top>
     <Scoreboard
       time='000'
-      levels={['beginner', 'intermediate', 'expert']}
+      levels={["", 'intermediate', 'expert']}
       bombs='010'
       onReset={() => null}

[NoCoverage] ArrowFunction
ReactCourses/minesweeper-react/src/index.tsx:16:16
       time='000'
       levels={['beginner', 'intermediate', 'expert']}
       bombs='010'
-      onReset={() => null}
+      onReset={() => undefined}
       onChangeLevel={() => null}
     />

[NoCoverage] ArrowFunction
ReactCourses/minesweeper-react/src/index.tsx:17:22
       levels={['beginner', 'intermediate', 'expert']}
       bombs='010'
       onReset={() => null}
-      onChangeLevel={() => null}
+      onChangeLevel={() => undefined}
     />
   </>,
