[Killed] BlockStatement
src/components/Grid/Cell.tsx:18:71
 export const isActiveCell = (cell: CellType): boolean =>
   [CellState.hidden, CellState.flag, CellState.weakFlag].includes(cell);
 
-export const Cell: FC<CellProps> = ({ children, coords, ...rest }) => {
-  const [mouseDown, onMouseDown, onMouseUp] = useMouseDown();
-
-  const onClick = () => rest.onClick(coords);
-
-  const onContextMenu = (event: React.MouseEvent<HTMLDivElement>) => {
-    event.preventDefault();
-
-    if (isActiveCell(children)) {
-      rest.onContextMenu(coords);
-    }
-  };
-
-  const props = {
-    onClick,
-    onContextMenu,
-    onMouseDown,
-    onMouseUp,
-    onMouseLeave: onMouseUp,
-    mouseDown,
-    'data-testid': `${coords}`,
-  };
-
-  return <ComponentsMap {...props}>{children}</ComponentsMap>;
-};
+export const Cell: FC<CellProps> = ({ children, coords, ...rest }) => {};
 
 Cell.displayName = 'Cell';
killedBy: Cell component check Cell renders correct
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
src/components/Grid/Cell.tsx:23:70
 
   const onClick = () => rest.onClick(coords);
 
-  const onContextMenu = (event: React.MouseEvent<HTMLDivElement>) => {
-    event.preventDefault();
-
-    if (isActiveCell(children)) {
-      rest.onContextMenu(coords);
-    }
-  };
+  const onContextMenu = (event: React.MouseEvent<HTMLDivElement>) => {};
 
   const props = {
killedBy: Cell component check Check prevent default contextMenu for every type of cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:72:5
       );
     case CellState.hidden:
       return <ClosedFrame {...rest}>{children}</ClosedFrame>;
-    case CellState.flag:
-      return (
-        <ClosedFrame {...rest}>
-          <Flag />
-        </ClosedFrame>
-      );
+    case CellState.flag:
     case CellState.weakFlag:
       return (
killedBy: Cell component check Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correct 12`

- Snapshot  - 1
+ Received  + 1

@@ -2,9 +2,9 @@
