[Killed] ArrowFunction
src/components/Scoreboard/Counter.tsx:8:47
   children: string;
 }
 
-export const Counter: FC<CounterProps> = memo(({ children }) => (
-  <Frame>{children}</Frame>
-));
+export const Counter: FC<CounterProps> = memo(() => undefined);
 
 Counter.displayName = 'Counter';
killedBy: Scoreboard test cases Scoreboard renders correctly
statusReason: Error: Counter(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
