[Killed] BlockStatement
src/components/Scoreboard/Reset.tsx:10:60
   onReset: () => void;
 }
 
-export const Reset: FC<ResetProps> = memo(({ onReset }) => {
-  const [mouseDown, onMouseDown, onMouseUp] = useMouseDown();
-
-  return (
-    <Button
-      onMouseDown={onMouseDown}
-      onMouseLeave={onMouseUp}
-      onMouseUp={onMouseUp}
-      onClick={onReset}
-    >
-      {mouseDown ? '😯' : '🙂'}
-    </Button>
-  );
-});
+export const Reset: FC<ResetProps> = memo(({ onReset }) => {});
 
 Reset.displayName = 'Reset';
killedBy: Scoreboard test cases Scoreboard renders correctly
statusReason: Error: Reset(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
