[Killed] ArrowFunction
src/components/Top/Top.tsx:10:3
 export type TopComponentType = LegendProps & GameNameProps;
 
 export const Top: FC<TopComponentType> = memo(
-  ({ children, ...legendProps }) => (
-    <Header>
-      <GameName>{children}</GameName>
-      <Legend {...legendProps} />
-    </Header>
-  )
+  () => undefined
 );
 
killedBy: Top renders correctly
statusReason: Error: Top(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
