[Killed] BlockStatement
src/components/hooks/useMouseDown.ts:10:6
   boolean,
   SetMouseDownStatus,
   SetMouseUpStatus
-] => {
-  const [mouseDown, setMouseDown] = useState(false);
-
-  const onMouseDown = useCallback(() => setMouseDown(true), []);
-  const onMouseUp = useCallback(() => setMouseDown(false), []);
-
-  return [mouseDown, onMouseDown, onMouseUp];
-};
+] => {};
 
killedBy: Cell component check Cell renders correct
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BooleanLiteral
src/components/hooks/useMouseDown.ts:13:54
 ] => {
   const [mouseDown, setMouseDown] = useState(false);
 
-  const onMouseDown = useCallback(() => setMouseDown(true), []);
+  const onMouseDown = useCallback(() => setMouseDown(false), []);
   const onMouseUp = useCallback(() => setMouseDown(false), []);
 
killedBy: Reset button check Should change state when onMouseDown and onMouseUp events happened
statusReason: TestingLibraryElementError: Unable to find an element with the text: 😯. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <button
      class="css-1kb3z2h"
    >

[Killed] ArrowFunction
src/components/hooks/useMouseDown.ts:13:35
 ] => {
   const [mouseDown, setMouseDown] = useState(false);
 
-  const onMouseDown = useCallback(() => setMouseDown(true), []);
+  const onMouseDown = useCallback(() => undefined, []);
   const onMouseUp = useCallback(() => setMouseDown(false), []);
 
killedBy: Reset button check Should change state when onMouseDown and onMouseUp events happened
statusReason: TestingLibraryElementError: Unable to find an element with the text: 😯. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <button
      class="css-1kb3z2h"
    >

[Killed] ArrowFunction
src/components/hooks/useMouseDown.ts:14:33
   const [mouseDown, setMouseDown] = useState(false);
 
   const onMouseDown = useCallback(() => setMouseDown(true), []);
-  const onMouseUp = useCallback(() => setMouseDown(false), []);
+  const onMouseUp = useCallback(() => undefined, []);
 
   return [mouseDown, onMouseDown, onMouseUp];
killedBy: Reset button check Should change state when onMouseDown and onMouseUp events happened
statusReason: TestingLibraryElementError: Unable to find an element with the text: 🙂. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <button
      class="css-1kb3z2h"
    >

[Killed] BooleanLiteral
src/components/hooks/useMouseDown.ts:14:52
   const [mouseDown, setMouseDown] = useState(false);
 
   const onMouseDown = useCallback(() => setMouseDown(true), []);
-  const onMouseUp = useCallback(() => setMouseDown(false), []);
+  const onMouseUp = useCallback(() => setMouseDown(true), []);
 
   return [mouseDown, onMouseDown, onMouseUp];
killedBy: Reset button check Should change state when onMouseDown and onMouseUp events happened
statusReason: TestingLibraryElementError: Unable to find an element with the text: 🙂. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <button
      class="css-1kb3z2h"
    >
