[Killed] EqualityOperator
minesweeper-react/src/core/CellsManipulator.ts:18:23
 });
 
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
-  y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
+  y >= 0 && x >= 0 && length - y >= 0 && length - x > 0;
 
 export const incrementNeighbors = (coords: Coords, field: Field): Field => {
killedBy: checkItemInField tests Simple cases Out of y range
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
minesweeper-react/src/core/CellsManipulator.ts:20:76
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
   y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
 
-export const incrementNeighbors = (coords: Coords, field: Field): Field => {
-  const items = getNeighborsItems(coords);
-
-  for (const [y, x] of Object.values(items)) {
-    if (checkItemInField([y, x], field)) {
-      const cell = field[y][x];
-      if (cell < 8) {
-        field[y][x] = (cell + 1) as Cell;
-      }
-    }
-  }
-
-  return field;
-};
+export const incrementNeighbors = (coords: Coords, field: Field): Field => {};
 
killedBy: Check Increment Neibours Simple cases Field with only one item
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [[9]]
Received: undefined
