[Killed] UpdateOperator
minesweeper-react/src/core/Field.ts:30:29
 
   const result: Field = generateFieldWithDefaultState(size);
 
-  for (let y = 0; y < size; y++) {
+  for (let y = 0; y < size; y--) {
     for (let x = 0; x < size; x++) {
       if (restCellsWithBombs === 0) {
killedBy: Field Generator Simple cases 2x2 field with mines
statusReason: TypeError: Cannot set properties of undefined (setting '0')

[Killed] BlockStatement
minesweeper-react/src/core/Field.ts:30:34
 
   const result: Field = generateFieldWithDefaultState(size);
 
-  for (let y = 0; y < size; y++) {
-    for (let x = 0; x < size; x++) {
-      if (restCellsWithBombs === 0) {
-        return result;
-      }
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
-        result[y][x] = CellState.bomb;
-        incrementNeighbors([y, x], result);
-        restCellsWithBombs--;
-      }
-      unprocessedCells--;
-    }
-  }
+  for (let y = 0; y < size; y++) {}
 
   return result;
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] UpdateOperator
minesweeper-react/src/core/Field.ts:31:31
   const result: Field = generateFieldWithDefaultState(size);
 
   for (let y = 0; y < size; y++) {
-    for (let x = 0; x < size; x++) {
+    for (let x = 0; x < size; x--) {
       if (restCellsWithBombs === 0) {
         return result;
killedBy: Field Generator Simple cases 2x2 field with mines
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      9,

[Killed] ConditionalExpression
minesweeper-react/src/core/Field.ts:32:11
 
   for (let y = 0; y < size; y++) {
     for (let x = 0; x < size; x++) {
-      if (restCellsWithBombs === 0) {
+      if (true) {
         return result;
       }
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] EqualityOperator
minesweeper-react/src/core/Field.ts:32:11
 
   for (let y = 0; y < size; y++) {
     for (let x = 0; x < size; x++) {
-      if (restCellsWithBombs === 0) {
+      if (restCellsWithBombs !== 0) {
         return result;
       }
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] ConditionalExpression
minesweeper-react/src/core/Field.ts:35:11
       if (restCellsWithBombs === 0) {
         return result;
       }
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
+      if (false) {
         result[y][x] = CellState.bomb;
         incrementNeighbors([y, x], result);
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] ArithmeticOperator
minesweeper-react/src/core/Field.ts:35:11
       if (restCellsWithBombs === 0) {
         return result;
       }
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
+      if (restCellsWithBombs * unprocessedCells > Math.random()) {
         result[y][x] = CellState.bomb;
         incrementNeighbors([y, x], result);
killedBy: Field Generator Simple cases Real game field size = 10x10 with 1/4 mined cells (25 mines)
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not "99999999999999999999"

[Killed] ArrayDeclaration
minesweeper-react/src/core/Field.ts:37:28
       }
       if (restCellsWithBombs / unprocessedCells > Math.random()) {
         result[y][x] = CellState.bomb;
-        incrementNeighbors([y, x], result);
+        incrementNeighbors([], result);
         restCellsWithBombs--;
       }
killedBy: Field Generator Simple cases 2x2 field with 50% probability
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Killed] UpdateOperator
minesweeper-react/src/core/Field.ts:38:9
       if (restCellsWithBombs / unprocessedCells > Math.random()) {
         result[y][x] = CellState.bomb;
         incrementNeighbors([y, x], result);
-        restCellsWithBombs--;
+        restCellsWithBombs++;
       }
       unprocessedCells--;
killedBy: Field Generator Simple cases 2x2 field with 50% probability
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 3
Received array:  [9, 9, 9]
